TestEDT/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <comment>ДУ</comment>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <comment>(Общ) Определяет валюту взаиморасчетов по договору, не может меняться, если по договору проведен хотя бы один документ</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>(упр.)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.Портфели</types>
    </type>
  </attributes>
  <attributes>
    <name>УправляющаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>БрокерскийСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestEDT/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаРегламентированногоУчета = УА_ПривилегированныйСервер.ВалютаРеглУчета(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ВалютаВзаиморасчетов) Тогда
			Объект.ВалютаВзаиморасчетов = ВалютаРегламентированногоУчета;			
		КонецЕсли;	
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НаименованиеНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзСписка(ОписаниеОповещения, ПолучитьСборкуНаименования(), Элемент);

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбораЗавершение(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Наименование = ВыбранноеЗначение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция получет сборку наименования
//
// Параметры:
//  Отсутствуют
//
// Возвращаемое значение:
//   СписокЗначений
//
&НаКлиенте
Функция ПолучитьСборкуНаименования()
	
	СЗ = Новый СписокЗначений;
	
	// Стандартная
	НомерНорм = СокрЛП(Объект.НомерДоговора);
	
	Если НомерНорм <> "" тогда
		НомерНорм = ?(Найти(НомерНорм, "№")=0, "№" + НомерНорм, НомерНорм);
	КонецЕсли;
	Сборка1 = НомерНорм + ?(Объект.ДатаДоговора = '00010101', "", " от " + Строка(Формат(Объект.ДатаДоговора, "ДЛФ=DD")))
		+" "+Строка(Объект.Владелец);
	Сборка1 = Сборка1+?(Объект.ВалютаВзаиморасчетов.Пустая(), "", " "+Строка(Объект.ВалютаВзаиморасчетов));  
			
	СЗ.Добавить(Сборка1);
	
	Возврат СЗ;
	
КонецФункции // ПолучитьСборкуНаименования()

#КонецОбласти
